## Week-4 Assignment: Pandas Basics
Welcome to the Week-4 assignment! This week, you'll practice the foundational features of Pandas, the most popular library for data manipulation and analysis in Python. This assignment is designed to evaluate your understanding of Pandas basics while keeping it manageable. Marks are assigned to each task, so you can track your progress.

Date: 25 January, 2025 <br>
Author: Audity Ghosh, CSE'17, RUET<br>
Plan: RUET DS AI Community Week 4 Task 2

import necessary libraries

In [1]:
import pandas as pd

# 1. Creating DataFrames (10 Marks)
Create a Pandas DataFrame with the following data:<br>
Name Age Gender Score <br>
Alice 23 Female 85<br>
Bob 25 Male 78<br>
Charlie 22 Male 90<br>
Diana 24 Female 92<br>

In [3]:
# create dataframe

data = pd.DataFrame({'Name':['Alice','Bob','Charlie','Diana'], 'Age':[23,25,22,24], 'Gender':['Female','Male','Male','Female'], 'Score':[85,78,90,92]})

Display the first 3 rows of the DataFrame. (2 Marks)

In [4]:
data[:3]

      Name  Age  Gender  Score
0    Alice   23  Female     85
1      Bob   25    Male     78
2  Charlie   22    Male     90

Get the column names and data types. (2 Marks)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Gender  4 non-null      object
 3   Score   4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

Add a new column named Passed with a value of True if the Score is greater than 80, otherwise False. (3 Marks)

In [7]:
data['Passed'] = data['Score'] > 80
data

      Name  Age  Gender  Score  Passed
0    Alice   23  Female     85    True
1      Bob   25    Male     78   False
2  Charlie   22    Male     90    True
3    Diana   24  Female     92    True

Drop the Gender column from the DataFrame. (3 Marks)

In [8]:
data = data.drop(columns=['Gender'])
data

      Name  Age  Score  Passed
0    Alice   23     85    True
1      Bob   25     78   False
2  Charlie   22     90    True
3    Diana   24     92    True

## 2. Indexing and Slicing (10 Marks)

Select and display only the Name and Score columns. (2 Marks)

In [11]:
data.loc[:, ['Name', 'Score']]

      Name  Score
0    Alice     85
1      Bob     78
2  Charlie     90
3    Diana     92

Filter and display rows where Score is greater than 85. (3 Marks)

In [12]:
data.loc[data.Score > 85]

      Name  Age  Score  Passed
2  Charlie   22     90    True
3    Diana   24     92    True

Display the row for the student named "Bob" using loc. (2 Marks)

In [13]:
data.loc[data.Name == 'Bob']

  Name  Age  Score  Passed
1  Bob   25     78   False

Display the last 2 rows of the DataFrame. (3 Marks)

In [14]:
data.iloc[-2:]

      Name  Age  Score  Passed
2  Charlie   22     90    True
3    Diana   24     92    True

## 3. Data Analysis (15 Marks)

Calculate the average age of students. (2 Marks)

In [15]:
average_age = data['Age'].mean()
average_age

23.5

Find the maximum and minimum scores. (2 Marks)

In [16]:
max_score = data['Score'].max()
min_score = data['Score'].min()

print(f"The maximum score is {max_score}")
print(f"The minimum score is {min_score}")

The maximum score is 92
The minimum score is 78

Count the number of students who passed. (3 Marks)

In [17]:
# Count the number of students who passed
num_passed = data['Passed'].sum()
num_passed

3

Group the data by the Passed column and calculate the average score for each group. (4 Marks)

In [19]:
data.groupby('Passed').Score.mean()

Passed
False    78
True     89
Name: Score, dtype: int64

Sort the DataFrame by Score in descending order. (4 Marks)

In [20]:
data.sort_values(by='Score', ascending=False)

      Name  Age  Score  Passed
3    Diana   24     92    True
2  Charlie   22     90    True
0    Alice   23     85    True
1      Bob   25     78   False

## 4. Importing and Exporting Data (5 Marks)

Save the DataFrame from Task 1 as a CSV file named students.csv. (2 Marks)

In [21]:
# Save the DataFrame as a CSV file
data.to_csv('students.csv', index=False)

Read the students.csv file back into a new DataFrame and display it. (3 Marks)

In [22]:
# Read the CSV file into a new DataFrame
df_new = pd.read_csv('students.csv')

# Display the DataFrame
print(df_new)

      Name  Age  Score  Passed
0    Alice   23     85    True
1      Bob   25     78   False
2  Charlie   22     90    True
3    Diana   24     92    True

## 5. Real-World Problem (10 Marks)

Create a DataFrame with the following sales data:<br>
Product Category Sales Discount<br>
Laptop Electronics 500 50<br>
Smartphone Electronics 300 30<br>
Desk Furniture 200 20<br>
Chair Furniture 150 15<br>

In [23]:
df = pd.DataFrame({
    'Product': ['Laptop', 'Smartphone', 'Desk', 'Chair'],
    'Category': ['Electronics', 'Electronics', 'Furniture', 'Furniture'],
    'Sales': [500, 300, 200, 150],
    'Discount': [50, 30, 20, 15]
})

In [24]:
df

      Product     Category  Sales  Discount
0      Laptop  Electronics    500        50
1  Smartphone  Electronics    300        30
2        Desk    Furniture    200        20
3       Chair    Furniture    150        15

Calculate a new column named Net Sales as Sales - Discount. (3 Marks)

In [25]:
# Calculate the 'Net Sales' column
df['Net Sales'] = df['Sales'] - df['Discount']

# Display the updated DataFrame
print(df)

      Product     Category  Sales  Discount  Net Sales
0      Laptop  Electronics    500        50        450
1  Smartphone  Electronics    300        30        270
2        Desk    Furniture    200        20        180
3       Chair    Furniture    150        15        135

Group the data by Category and calculate total sales for each category. (4 Marks)

In [26]:
df.groupby('Category').Sales.sum()

Category
Electronics    800
Furniture      350
Name: Sales, dtype: int64

Find the product with the highest net sales. (3 Marks)

In [28]:
# Find the product with the highest net sales
highest_net_sales_product = df.loc[df['Net Sales'].idxmax()].Product

# Display the result
print("Product with the highest net sales:")
print(highest_net_sales_product)

Product with the highest net sales:
Laptop